Autodesk.Revit.DB.WorksetFilter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksetFilter.IncludeStandaloneWorksetsOnly
True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected.
Since:
2012

Autodesk.Revit.DB.WorksetFilter.Inverted
True if the results of the filter are inverted; worksets that would normally be accepted by this filter will be rejected,
and worksets that would normally be rejected will be accepted.
Since:
2012

Autodesk.Revit.DB.WorksetFilter
A base class for a type of filter that accepts or rejects worksets based upon criteria.
Since:
2012